InformationRegisters/бит_БитфонНастройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>бит_БитфонНастройки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПрофильНастроек</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ПрофилиНастроекБИТPhone</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресПрокси</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CallerID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>IDАвторизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Протокол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_Протоколы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИнтервалПеререгистрации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвтоопределениеNAT</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерФакса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьДиректорияОтправкиФаксов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>260</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьПользовательОтправкиФаксов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьПарольОтправкиФаксов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДиректорияЗаписанныхФайлов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>260</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФорматЗаписи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ФорматЗаписи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КомандаПереадресации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьКомандаОтправкиФакса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГлубинаИсторииЗвонков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрефиксВыходаНаВнешнююЛинию</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьПрямойНабор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьКомандуНеБеспокоитьНаАТС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КомандаНеБеспокоить</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КомандаОтменаНеБеспокоить</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РежимНеБеспокоить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СерверЛицензийАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>260</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СерверЛицензийПорт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СерверЛицензийНеИспользоватьПрокси</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СоздаватьСобытиеПриВходящемЗвонке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОткрыватьИзбранноеПриПереводеЗвонка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвтоподнятиеПриВхЗвонке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СоздаватьСобытиеПриИсходящемЗвонке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СоздаватьСобытияПриВнутреннихЗвонках</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвтопереводНаМенеджера</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерАвтопереводаНеизвестногоКонтрагента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВсегдаЗаписыватьРазговор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтправкаСМСЛогин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтправкаСМСПароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтправкаСМСОтправитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИнтеграцияСБИТАТС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АстерискЛогин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦветСтатусаСвободен</Name>
					<Comment>На форму не помещается</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦветСтатусаОжидание</Name>
					<Comment>На форму не помещается</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦветСтатусаНомерНеНайден</Name>
					<Comment>На форму не помещается</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦветСтатусаРазговаривает</Name>
					<Comment>На форму не помещается</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦветСтатусаНеДоступен</Name>
					<Comment>На форму не помещается</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АстерискПароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АстерискДиректорияЗаписанныхФайлов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АстерискКонтекст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УровеньЛоггирования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтационарныйТелефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьСтационарныйТелефон</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвтозапускПриСтартеСистемы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СвойНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазворачиватьОкноПриВходящемЗвонке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОткрыватьКартуЯндексПриВходящемЗвонке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьТипПодключенияСтатусов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_УдалитьТипПодключенияСтатуса</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПолучениеСтатусов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеИскатьКонтрагента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипПриемаЗвонка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ТипПриемаЗвонка</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПривязыватьФайлПриИсходящемЗвонке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипПереводаЗвонка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ТипПереводаЗвонка</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПриниматьНесколькоВходящих</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>RTPПорт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДетекторАктивностиМикрофона</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СписокКодеков</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УстройствоВыводаЗвукаВходящегоЗвонка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВерсияСофтфона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_БитфонНастройки/Forms/ФормаЗаписиБезПользователя/Ext/Form/Module.bsl
&НаКлиенте
Функция ПолучитьИмяУстройстваПоУмолчанию()
	Возврат "(по умолчанию)";
КонецФункции

&НаКлиенте
Процедура ДиректорияЗаписанныхФайловНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	стрКаталогНач = Запись.ДиректорияЗаписанныхФайлов;
	длг = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	длг.Каталог = стрКаталогНач;
	бит_ТелефонияКлиентПереопределяемый.ПоказВыборФайла(длг, "БитФонНастройки_ВыборДиректорииЗаписиЗавершение", стрКаталогНач);
КонецПроцедуры

&НаКлиенте
Процедура ДиректорияЗаписанныхФайловЗавершение(ВыбранныеФайлы, НачальныйКаталог)
	Если ЗначениеЗаполнено(ВыбранныеФайлы) Тогда
		выбранКаталог = ВыбранныеФайлы[0];
		Запись.ДиректорияЗаписанныхФайлов = выбранКаталог;
		Если выбранКаталог <> НачальныйКаталог Тогда
			Модифицированность = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьДоступность();
	Элементы.ВерсияБитфона.Заголовок = "Версия БИТ.Phone " + бит_ТелефонияСервер.ПолучитьВерсиюПодсистемы();
	
	стрПоУмолчанию = ПолучитьИмяУстройстваПоУмолчанию();
	Элементы.УстройствоВыводаЗвонка.СписокВыбора.Очистить();
	Элементы.УстройствоВыводаЗвонка.СписокВыбора.Добавить(стрПоУмолчанию);
	списокУстройств = бит_ТелефонияКлиентСервер.СтрРазбить(Параметры.СписокУстройствВывода, ";");
	Для Каждого ЗвукУстройствоЭл Из списокУстройств Цикл
		ЗвукУстройство = ЗвукУстройствоЭл.Значение;
		Элементы.УстройствоВыводаЗвонка.СписокВыбора.Добавить(ЗвукУстройство);
	КонецЦикла;
	УстройствоВыводаЗвонка = Запись.УстройствоВыводаЗвукаВходящегоЗвонка;
	Если НЕ ЗначениеЗаполнено(УстройствоВыводаЗвонка) Тогда
		УстройствоВыводаЗвонка = стрПоУмолчанию;
	КонецЕсли;
	
	ОбновитьСписокКодеков();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДоступность()
	Элементы.ПрефиксВыходаНаВнешнююЛинию.Доступность = НЕ Запись.ИспользоватьПрямойНабор;
	//
	Элементы.СтационарныйТелефон.Доступность = Запись.ИспользоватьСтационарныйТелефон;
    Элементы.ТипПриемаЗвонка.Доступность = Запись.ИспользоватьСтационарныйТелефон;
	//
	Элементы.СоздаватьСобытияПриВнутреннихЗвонках.Доступность = (Запись.СоздаватьСобытиеПриВходящемЗвонке ИЛИ Запись.СоздаватьСобытиеПриИсходящемЗвонке);
	//
	Если (Запись.ПрофильНастроек = ПредопределенноеЗначение("Перечисление.бит_ПрофилиНастроекБИТPhone.БИТ_АТС")) ИЛИ
		(Запись.ПрофильНастроек = ПредопределенноеЗначение("Перечисление.бит_ПрофилиНастроекБИТPhone.Произвольные"))
	Тогда
		Элементы.ГруппаDND.Доступность = Истина;
	Иначе
		Элементы.ГруппаDND.Доступность = Ложь;
	КонецЕсли;
	//
	Элементы.КомандаПереадресации.Доступность = Запись.ТипПереводаЗвонка = ПредопределенноеЗначение("Перечисление.бит_ТипПереводаЗвонка.Условный");
	//
	Элементы.КомандаНеБеспокоить.Доступность = Запись.ИспользоватьКомандуНеБеспокоитьНаАТС;
	Элементы.КомандаОтменаНеБеспокоить.Доступность = Запись.ИспользоватьКомандуНеБеспокоитьНаАТС;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокКодеков()
	СписокКодеков.Очистить();
	массКодеков = бит_БитфонКлиент.РазобратьСписокКодеков(Запись.СписокКодеков);
	Для Каждого кодекПриор Из массКодеков Цикл
		строкаКодек = СписокКодеков.Добавить();
		ЗаполнитьЗначенияСвойств(строкаКодек, кодекПриор);
	КонецЦикла;
	СписокКодеков.Сортировать("Приоритет Убыв");
КонецПроцедуры

&НаКлиенте
Процедура ПрофильНастроекПриИзменении(Элемент)
	
	бит_БитфонКлиент.ОбработчикИзмененияПрофиляНастроек(Запись, Истина);
	
	ОбновитьДоступность();
	
	ОбновитьСписокКодеков();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздаватьСобытиеПриВходящемЗвонкеПриИзменении(Элемент)
	ОбновитьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура СоздаватьСобытиеПриИсходящемЗвонкеПриИзменении(Элемент)
	ОбновитьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ТипПереводаЗвонкаПриИзменении(Элемент)
	ОбновитьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьСтационарныйТелефонПриИзменении(Элемент)
	ОбновитьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьПрямойНаборПриИзменении(Элемент)
	ОбновитьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьКомандуНеБеспокоитьНаАТСПриИзменении(Элемент)
	ОбновитьДоступность();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	стрСписокКодеков = Запись.СписокКодеков;
	Если СписокКодеков.Количество() > 0 Тогда
		стрСписокКодеков = "";
		Для Каждого строкаКодек Из СписокКодеков Цикл
			стрКодек = строкаКодек.Кодек;
			стрПриор = Строка(строкаКодек.Приоритет);
			стрСписокКодеков = стрСписокКодеков + стрКодек + "=" + стрПриор + ";";
		КонецЦикла;
	КонецЕсли;
	ТекущийОбъект.СписокКодеков = стрСписокКодеков;
КонецПроцедуры

&НаКлиенте
Процедура УстройствоВыводаЗвонкаПриИзменении(Элемент)
	стрПоУмолчанию = ПолучитьИмяУстройстваПоУмолчанию();
	стрУстройствоВывода = УстройствоВыводаЗвонка;
	Если стрУстройствоВывода = стрПоУмолчанию Тогда
		стрУстройствоВывода = "";
	КонецЕсли;
	Если Запись.УстройствоВыводаЗвукаВходящегоЗвонка <> стрУстройствоВывода Тогда
		Запись.УстройствоВыводаЗвукаВходящегоЗвонка = стрУстройствоВывода;
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокКодековПриоритетПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПапкуСЛогФайлом(Команда)
	бит_ТелефонияКлиентПереопределяемый.ЗапускПрограммы("%APPDATA%\BIT");
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьЗапросВТехподдержку(Команда)
	бит_БитфонКлиент.ОтправитьЗапросВТехподдержкуСАрхивомЛога();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "БитФонНастройки_ВыборДиректорииЗаписиЗавершение" Тогда
		ДиректорияЗаписанныхФайловЗавершение(Параметр.Результат, Параметр.ПараметрОповещения);
	КонецЕсли;
КонецПроцедуры
